1) Изучить HashMap – написать что вы поняли о  HashMap (до 2 баллов)

2) Написать через функциональные интерфейсы цепочку обработчиков класса Person, которые 
  а) меняют маму с папой местами (такие времена) 
  б) логгируют “changed” (System.out.println()) 
  в) удаляют друга (friend = null) 
В роли цепочки использовать обычную коллекцию. (2 балла)
(Пояснения в тг)

3) Написать программу, которая в 3 потока увеличивает единичку до 30001. Кол-во инкрементаций в каждом потоке по 10000. (3 балла)

4) Интерфейс Iterable предоставляет итератор и метод forEach. В каких случаях forEach не сможет сделать то, что может итератор? Потыкайте, повыдумывайте кейсы (3 балла)
